Enums/УчетРабочегоВремениПриРасчетеСреднегоЗаработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УчетРабочегоВремениПриРасчетеСреднегоЗаработка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуГрафику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПятидневнойНеделе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШестидневнойНеделе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПятидневнойНеделе36</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШестидневнойНеделе36</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/УчетРабочегоВремениПриРасчетеСреднегоЗаработка/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПорядокОплатыСуммированногоУчет = Параметры.Свойство("ПорядокОплатыСуммированногоУчет") И Параметры.ПорядокОплатыСуммированногоУчет;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если НЕ ПорядокОплатыСуммированногоУчет Тогда
		ДанныеВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоФактическомуГрафику);
	КонецЕсли;
	
	ДанныеВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоПятидневнойНеделе);
	ДанныеВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоШестидневнойНеделе);
	
	Если ПорядокОплатыСуммированногоУчет Тогда
		ДанныеВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоПятидневнойНеделе36);	
		ДанныеВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоШестидневнойНеделе36);	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
